app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `userName` = 'WB/EMP/2022gtq0035121'
---
	public function login(){
		//echo "test";exit;
        $data=[];
        // $_SESSION['failed_login'] = 1;

        $builder=$this->db->table("users");

        $pass=$this->request->getPost('uPwd');
        $uname=$this->request->getPost('uname');


        $builder=$builder->where("userName",$uname);
		$userExists=$builder->get()->getResultArray();

SELECT *
FROM `users`
WHERE `id` = '12'
---
	public function singleEmpDetails($id = '')
	{
		$empId=$id;
		$data=[];
		$builder=$this->db->table("users");
		$builder=$builder->where("id",$empId);
		$userExists=$builder->get()->getResultArray();

SELECT *
FROM `users`
---
	public function allEmpListing()
	{

		$data=[];
		$usermodel = new UserModel();
		$userExists=$usermodel->findAll();

SELECT *
FROM `users`
WHERE `id` = '12'
 LIMIT 1
---
	public function edit($id)
	{

		 $data=[];
		 $usermodel = new UserModel();
		 $data['userExists']=$usermodel->where('id',$id)->first();